dataset path: /Users/chris/Source/Scratch/TFLearning/TF2xTutorials/14-Pixel2Pixel/facades/
train: (400, 256, 256, 6)
test: (106, 256, 256, 6)
Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
downsample (Downsample)      multiple                  3072
_________________________________________________________________
downsample_1 (Downsample)    multiple                  131584
_________________________________________________________________
downsample_2 (Downsample)    multiple                  525312
_________________________________________________________________
downsample_3 (Downsample)    multiple                  2099200
_________________________________________________________________
downsample_4 (Downsample)    multiple                  4196352
_________________________________________________________________
downsample_5 (Downsample)    multiple                  4196352
_________________________________________________________________
downsample_6 (Downsample)    multiple                  4196352
_________________________________________________________________
downsample_7 (Downsample)    multiple                  4196352
_________________________________________________________________
upsample (Upsample)          multiple                  4196352
_________________________________________________________________
upsample_1 (Upsample)        multiple                  8390656
_________________________________________________________________
upsample_2 (Upsample)        multiple                  8390656
_________________________________________________________________
upsample_3 (Upsample)        multiple                  8390656
_________________________________________________________________
upsample_4 (Upsample)        multiple                  4195328
_________________________________________________________________
upsample_5 (Upsample)        multiple                  1049088
_________________________________________________________________
upsample_6 (Upsample)        multiple                  262400
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr multiple                  6147
=================================================================
Total params: 54,425,859
Trainable params: 54,414,979
Non-trainable params: 10,880
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
disc_downsample (DiscDownsam multiple                  6144
_________________________________________________________________
disc_downsample_1 (DiscDowns multiple                  131584
_________________________________________________________________
disc_downsample_2 (DiscDowns multiple                  525312
_________________________________________________________________
zero_padding2d (ZeroPadding2 multiple                  0
_________________________________________________________________
conv2d_11 (Conv2D)           multiple                  2097152
_________________________________________________________________
batch_normalization_16 (Batc multiple                  2048
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin multiple                  0
_________________________________________________________________
conv2d_12 (Conv2D)           multiple                  8193
=================================================================
Total params: 2,770,433
Trainable params: 2,768,641
Non-trainable params: 1,792
_________________________________________________________________
0 0 1.6812949180603027 40.88779830932617
0 100 1.3952646255493164 32.67466354370117
