


Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
downsample (Downsample)      (1, 128, 128, 64)         3072      
_________________________________________________________________
downsample_1 (Downsample)    (1, 64, 64, 128)          131584    
_________________________________________________________________
downsample_2 (Downsample)    (1, 32, 32, 256)          525312    
_________________________________________________________________
downsample_3 (Downsample)    (1, 16, 16, 512)          2099200   
_________________________________________________________________
downsample_4 (Downsample)    (1, 8, 8, 512)            4196352   
_________________________________________________________________
downsample_5 (Downsample)    (1, 4, 4, 512)            4196352   
_________________________________________________________________
downsample_6 (Downsample)    (1, 2, 2, 512)            4196352   
_________________________________________________________________
downsample_7 (Downsample)    (1, 1, 1, 512)            4196352   
_________________________________________________________________
upsample (Upsample)          (1, 2, 2, 512)            4196352   
_________________________________________________________________
upsample_1 (Upsample)        (1, 4, 4, 512)            8390656   
_________________________________________________________________
upsample_2 (Upsample)        (1, 8, 8, 512)            8390656   
_________________________________________________________________
upsample_3 (Upsample)        (1, 16, 16, 512)          8390656   
_________________________________________________________________
upsample_4 (Upsample)        (1, 32, 32, 256)          4195328   
_________________________________________________________________
upsample_5 (Upsample)        (1, 64, 64, 128)          1049088   
_________________________________________________________________
upsample_6 (Upsample)        (1, 128, 128, 64)         262400    
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr multiple                  6147      
_________________________________________________________________
activation (Activation)      multiple                  0         
=================================================================
Total params: 54,425,859
Trainable params: 54,414,979
Non-trainable params: 10,880
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
downsample_8 (Downsample)    (1, 128, 128, 64)         6144      
_________________________________________________________________
downsample_9 (Downsample)    (1, 64, 64, 128)          131584    
_________________________________________________________________
downsample_10 (Downsample)   (1, 32, 32, 256)          525312    
_________________________________________________________________
zero_padding2d (ZeroPadding2 (1, 34, 34, 256)          0         
_________________________________________________________________
conv2d_11 (Conv2D)           (1, 31, 31, 512)          2097152   
_________________________________________________________________
batch_normalization_16 (Batc (1, 31, 31, 512)          2048      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (1, 31, 31, 512)          0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (1, 33, 33, 512)          0         
_________________________________________________________________
conv2d_12 (Conv2D)           (1, 30, 30, 1)            8193      
=================================================================
Total params: 2,770,433
Trainable params: 2,768,641
Non-trainable params: 1,792
_________________________________________________________________
Downloading to /Users/chris/.keras/datasets
Training for 100 epochs ...
input.shape=(1, 256, 256, 3), target.shape=(1, 256, 256, 3)
Process finished with exit code 0
